src/main/resources/uml/11-패키지-분류.puml
@startuml
package payment {
    class PaymentService {
        + prepare()
    }
}

package exchangerate {
    interface ExchangeRateProvider {
        + getExchangeRate()
    }

    class HttpApiExchangeRateProvider {
        + getExchangeRate()
    }

    class ExchangeRateData {
    }
}

PaymentService ..> ExchangeRateProvider : 사용
ExchangeRateProvider <|.. HttpApiExchangeRateProvider : 구현
ExchangeRateProvider .r.> ExchangeRateData
@enduml
